// KQL hunt for:
// Hidden Powershell window start
// Finds all PowerShell execution events wherein the PowerShell window has been explicitly hidden.
DeviceProcessEvents
| where InitiatingProcessFileName =~ "powershell.exe" or InitiatingProcessVersionInfoOriginalFileName =~ "PowerShell.EXE"
| where InitiatingProcessCommandLine has "-Command"
| where InitiatingProcessCommandLine has "-w hidden" or InitiatingProcessCommandLine has "-windowstyle hidden"
| where InitiatingProcessCommandLine !has ("Lenovo\\Udc")
| where InitiatingProcessCommandLine !has ("Killer Networking")
| where InitiatingProcessParentFileName !has ("npcap") 
