// KQL hunt for:
// Potential Plaintext Passwords Storage
union withsource=SourceTable AlertEvidence, DeviceProcessEvents, DeviceNetworkEvents, DeviceFileEvents, DeviceRegistryEvents, DeviceLogonEvents, DeviceImageLoadEvents, DeviceEvents
| where ActionType in ("FileTimestampModificationEvent", "FileCreated", "FileDeleted", "FileModified", "FileRenamed", "SensitiveFileRead")
| where (FileName contains "pass" or FileName contains "парол" or FileName contains "pwd" or FileName contains "creds" or FileName contains "credentials" ) 
//or FileName contains "account" or FileName contains "login")
  and (FileName endswith ".txt"
    or FileName endswith ".doc"
    or FileName endswith ".docx"
    or FileName endswith ".xls"
    or FileName endswith ".xlsx"
    or FileName endswith ".csv"
    or FileName endswith ".json"
    or FileName endswith ".md"
    or FileName endswith ".rtf"
    or FileName endswith ".xml"
    or FileName endswith ".yml"
    or FileName endswith ".yaml"
    or FileName endswith ".note"
    or FileName endswith ".onenote"
    or FileName endswith ".odt"
    or FileName endswith ".ods"
    or FileName endswith ".odp"
    //or FileName endswith ""
    //or FileName endswith ""    
    )
// FP:
| where FolderPath !contains "programdata" and FileName !contains "Microsoft.CredDialogHost" //common MS windows activity
| where FileName !contains "KeePass" //Password Manager activity
| where FileName !contains "Zeal.Authentication.ClientCredentials" //internal software
| where FolderPath !contains "Program Files\\WindowsApps" //default windows apps location
| project Timestamp, ReportId, DeviceName, InitiatingProcessAccountUpn, FolderPath, FileName, ActionType
